{
  "architectures": [
    "LongformerForSequenceClassification"
  ],
  "attention_mode": "longformer",
  "attention_probs_dropout_prob": 0.1,
  "attention_window": [
    512,
    512,
    512,
    512,
    512,
    512,
    512,
    512,
    512,
    512,
    512,
    512
  ],
  "bos_token_id": 0,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Construction & Real Estate",
    "1": "Energy & Utilities",
    "2": "Finance & Fintech",
    "3": "Healthcare & Life Sciences",
    "4": "Logistics & Transportation",
    "5": "Manufacturing",
    "6": "Media & Entertainment",
    "7": "Other",
    "8": "Professional Services",
    "9": "Retail & Consumer",
    "10": "Technology"
  },
  "ignore_attention_mask": false,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Construction & Real Estate": 0,
    "Energy & Utilities": 1,
    "Finance & Fintech": 2,
    "Healthcare & Life Sciences": 3,
    "Logistics & Transportation": 4,
    "Manufacturing": 5,
    "Media & Entertainment": 6,
    "Other": 7,
    "Professional Services": 8,
    "Retail & Consumer": 9,
    "Technology": 10
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 4098,
  "model_type": "longformer",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "onnx_export": false,
  "pad_token_id": 1,
  "problem_type": "single_label_classification",
  "sep_token_id": 2,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 1,
  "vocab_size": 50265
}
